et
sum
quī
que
in
nōn
hic
ille
tū
cum
ego
quisquam
is
ad
ut
sī
sui
omnis
nec
sed
ā
ipse
possum
aut
māgnus
ex
suus
dō
quam
per
videō
faciō
dīcō
iam
atque
ac
alius
rēs
habeō
animus
meus
deus
multus
tuus
ferō
dē
nē
manus
nūllus
nunc
nōs
noster
ūnus
diēs
nihil
tum
enim
tamen
īdem
rēx
nam
locus
veniō
inter
pars
volō
etiam
bonus
agō
terra
pater
neque
domus
at
corpus
quoque
aliquis
tōtus
sīc
hīc
iste
urbs
petō
iubeō
vir
bellum
vīta
homō
tempus
magis
prīmus
ubi
hostis
an
mors
tam
eō
arma
superus
nisi
vincō
pōnō
dum
sine
tantus
teneō
causa
sequor
crēdō
accipiō
virtūs
ante
quaerō
mittō
vīs
amor
caelum
sub
nox
ita
rēgnum
populus
autem
caput
mare
quīdam
māter
prō
quisquis
vōs
capiō
quia
dūcō
ergō
nōmen
quidem
miser
fortūna
novus
gravis
vel
longus
parvus
relinquō
saepe
fīō
ōs
alter
semper
deinde
ignis
modo
timeō
scelus
dēbeō
vīvō
fātum
vocō
altus
parō
mīles
medius
inquam
post
audiō
putō
annus
stō
vōx
genus
referō
sciō
mēns
reddō
licet
sōlus
fugiō
ūllus
nēmō
nātūra
mōs
beneficium
pectus
fidēs
patior
cūra
īra
verbum
prope
parēns
puer
moveō
dolor
gēns
modus
via
quisque
amīcus
pēs
imperium
labor
ingēns
tālis
parum
apud
oculus
unda
itaque
vultus
cadō
nātus
quis
trahō
sanguis
metus
tantum
cōnsilium
coniunx
amō
levis
duo
ferus
poena
castrum
frāter
haud
malus
iaceō
līber
iter
ferrum
spēs
puella
silva
bene
fīnis
gerō
ne
dux
premō
dominus
mōns
uterque
saevus
lītus
soleō
mīlle
equus
dūrus
cōgō
numquam
prīmum
morior
carmen
tēlum
ratiō
umbra
ars
tot
dexter
sīgnum
laetus
quālis
lēx
perīculum
nāscor
exercitus
pereō
ventus
audeō
contrā
aqua
rapiō
simul
trīstis
mūnus
iuvenis
fāma
adsum
vērō
pār
vester
flūmen
quīcumque
certus
fortis
placeō
vertō
servō
honor
dīgnus
cūnctus
tollō
negō
vetus
eques
trādō
flamma
lūx
unde
redeō
sentiō
aurum
cēdō
quō
saxum
ve
aetās
fēlīx
loquor
quantus
coepī
igitur
iūs
mūtō
inveniō
prīnceps
ops
recipiō
sōl
cōnsul
orbis
turba
ager
solvō
vitium
vulnus
inde
senātus
ūtor
cōpia
opus
colō
vōtum
iugum
quā
tellus
numerus
cōgnōscō
victor
satis
patria
seu
cāsus
frangō
cīvitās
nōscō
proelium
ēripiō
mundus
cursus
vix
nāvis
lacrima
hūmānus
mollis
maneō
āgmen
sīdus
glōria
diū
sīve
tamquam
fuga
tūtus
auris
aliēnus
hūc
taceō
legiō
ostendō
socius
prōsum
āra
lūmen
tegō
turpis
voluptās
adhūc
grātia
iniūria
latus
dulcis
postquam
extrēmus
tēctum
ingenium
pāx
canō
iuvō
campus
claudō
doceō
excipiō
clārus
illīc
procul
sacer
mora
longē
super
errō
sēdēs
cūr
coma
aiō
gaudeō
beātus
perveniō
vērus
incipiō
parcō
vestis
similis
caedēs
ōrdō
optō
virgō
legō
aura
impetus
fōrma
praestō
aequor
misceō
spatium
tandem
īnferus
metuō
temptō
trānseō
ultimus
addō
grātus
laudō
nōndum
impōnō
somnus
aciēs
rūrsus
cupiō
exspectō
compōnō
laus
absum
ūsus
velut
comes
ob
studium
facilis
nūmen
sapiēns
sūmō
nōbilis
quīn
fleō
nōlō
plēnus
adversus
nemus
cārus
dēsum
lēgātus
discō
furor
amnis
arbor
mox
eō
cīvis
occupō
spectō
tergum
crīmen
dōnum
nōtus
sinus
faciēs
rumpō
membrum
umquam
aspiciō
prius
templum
āmittō
pōscō
perdō
quamvīs
tener
currus
precor
anima
contingō
lībertās
servus
soror
fluctus
quīppe
exigō
fēmina
nimius
fallō
mīror
classis
sedeō
singulī
mūrus
noceō
quoniam
fax
intellegō
iungō
afferō
cōgitō
līmen
pūblicus
queror
exemplum
prex
dubitō
odium
fundō
fūnus
nesciō
prior
ūsque
dubius
tendō
pecūnia
quemadmodum
spargō
trēs
tangō
respondeō
timor
properō
subeō
valeō
condō
nefās
quondam
auxilium
dēserō
nūdus
auctor
animal
decus
salūs
pateō
rogō
uxor
abeō
regō
adeō
auferō
quantum
senex
frōns
propter
rēgius
currō
pellō
dīves
iūdicō
pecus
potēns
scrībō
pulcher
surgō
cēterum
careō
efficiō
ōlim
sermō
exerceō
gradus
agitō
fortē
honestus
moror
praesidium
sonō
praebeō
regiō
sententia
ācer
suprā
brevis
citus
cornu
ingrātus
moenia
vinculum
adeō
cēterus
exeō
mālō
speciēs
ultrā
certē
imperō
male
prohibeō
clāmor
dōnō
officium
committō
crēscō
aequus
factum
caedō
exīstimō
accēdō
contemnō
pudor
antīquus
ārdeō
ibi
prōvincia
quandō
custōs
supersum
dēsinō
fessus
praeda
memoria
dīvidō
pretium
pontus
varius
vehō
falsus
niger
oppidum
pondus
arvum
arx
sors
vīnum
dīversus
orior
ecce
quamquam
cōnferō
facinus
retineō
spērō
plēbs
pūgna
repetō
cōnstituō
dēfendō
marītus
cernō
superbus
adversus
morbus
sānctus
commūnis
dēdūcō
rīpa
concēdō
hōra
vetō
cohors
gīgnō
superō
maestus
meminī
impleō
māgnitūdō
vacuus
vagus
vulgus
deficiō
occurrō
statuō
ideō
praemium
praetereā
tertius
supplicium
vātēs
astrum
undique
canis
ēdō
fateor
amīcitia
aureus
candidus
interim
frūstrā
lateō
os
sēcūrus
conveniō
interficiō
appellō
dolus
permittō
spīritus
intrā
terreō
fōns
invidia
pugnō
augeō
littera
moneō
dīvitiae
experior
superī
ōtium
vestīgium
sinō
decet
effundō
prōmittō
fingō
respicio
imperātor
vacō
color
discēdō
gaudium
caecus
libet
centum
cōnstō
lingua
multitūdō
aeternus
circā
ōrātiō
potestās
tardus
for
humus
testis
īnferō
cūrō
aes
celer
prōcēdō
mēnsa
pius
iūdicium
victōria
damnō
rārus
tempestas
imāgō
ōrō
praeter
cōnsulō
iterum
porta
intersum
libīdō
sustineō
aliquandō
māiōrēs
reperiō
intrō
pietās
barbarus
culpa
iūstus
dōnec
fluō
necesse
reor
tenebrae
saeculum
dīmittō
licet
cinis
cōnsistō
recēns
aliter
laedō
probō
doleō
quārē
antequam
reliquus
semel
ōdī
sīcut
peccō
sēnsus
exsilium
cor
dēnique
sapientia
statim
accidō
dēcernō
occīdō
dēscendō
hiems
contineō
dēferō
oportet
tribūnus
bōs
īrāscor
aeger
forum
offerō
revocō
cingō
integer
validus
alō
flōs
īctus
colligō
pergō
praesēns
rēctus
lātus
praeceptum
recēdō
utrum
famēs
pariō
appāreō
quōmodo
error
forsitan
convertō
proficīscor
secundus
aperiō
castus
iūdex
lapis
nimis
onus
opera
pauper
āēr
negōtium
pāreō
subitō
argentum
ūtilis
aethēr
mereō
portō
proprius
avis
vanus
māteria
paucī
voluntās
ēgregius
difficilis
gladius
cibus
certō
initium
pertineō
quattuor
turbō
cōnsūmō
corrumpō
incidō
paulō
hospes
rīdeō
aevum
audāx
posterus
praetor
rūs
differō
vītō
prīvātus
serviō
vereor
ingredior
addūcō
hortor
reus
scīlicet
comparō
perpetuus
dēsīderō
celebrō
cōnficiō
intendō
iūrō
sōlum
auctōritās
iaciō
labōrō
liber
lūna
prōtinus
aequē
cōnor
cupīdō
ferē
īnsula
fīlia
narrō
necessitās
ēgredior
poēta
decem
amplus
aptus
cōnsequor
frequēns
nūntius
condīciō
convīvium
foedus
fruor
num
albus
damnum
frūctus
cēnseō
prōdō
prōpōnō
īnstituō
item
magister
stella
ēdūcō
frūmentum
suscipiō
quasi
sacerdōs
vīcīnus
caveō
ēligō
familia
paene
praecipiō
sānus
potis
prīncipium
sepulcrum
mortālis
epistula
inimīcus
interrogō
cōnsuētūdo
illūc
dīgnitās
fugō
afficiō
adhibeō
caelestis
mulier
dīvus
arbitror
posteā
aedēs
fābula
celeriter
plērus
quiēscō
quotiēns
scientia
cōnfiteor
dīligō
plērumque
dormiō
volucris
volucer
creō
fidēlis
indicō
hodiē
disciplīna
vērē
aegrē
fore
advertō
adveniō
pendō
studeō
ascendō
vulgō
breviter
fors
fēlīciter
revertō
ēdīcō
mundus
